cases/10x7e/RPM_3000/kOmegaSStUnsteady/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM: The Open Source CFD Toolbox                                      |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}


mover
{
    type          motionSolver;
    libs          ("libfvMeshMovers.so" "librigidBodyMeshMotion.so");

    motionSolver  motionSolverList;

    motionSolverListCoeffs
    {
        solvers
        {
            rotor
            {
                motionSolver    solidBody;
                cellZone        innerCylinder;

                solidBodyMotionFunction rotatingMotion;

                rotatingMotionCoeffs
                {
                    origin  (0 0 0);
                    axis    (0 1 0);
                    omega   314.16;
                }
            }
        }
    }
}

