cases/10x7e/RPM_3000/kOmegaSStUnsteady/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.2;

deltaT          1e-5;

writeControl    timeStep;
writeInterval   10;

////- For testing with moveDynamicMesh
//deltaT          0.01;
//writeControl    timeStep;
//writeInterval   1;

purgeWrite      2;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           2;

functions
{
    forcesBlades
    {
        type            forces;
        libs            ("libforces.so");

        patches         (propellerTip);    

        // For incompressible simpleFoam:
        rho             rhoInf;
        rhoInf          1.225;      

        CofR            (0 0 0);   
        log             yes;
    }

    velocityProbe
    {
        type            probes;
        libs            ("libsampling.so");
        fields          (U);
        probeLocations  ((0.128 0.01 0.01));  
        writeControl    timeStep;
        writeInterval   10;
    }

    yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        patches         (propellerTip);
        log             yes;
        writeControl    timeStep;
        writeInterval   10;

        // Enable to also view y+ distribution in paraFoam
        // objects         ();
    }

    wallShear
    {
        type            wallShearStress;
        libs            ("libfieldFunctionObjects.so");
        patches         (propellerTip);
        log             yes;
        writeControl    timeStep;
        writeInterval   10;

    }

    residuals
    {
        type            residuals;
        libs            ("libutilityFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   10;
        fields
        (
            p
            U
            k
            omega
        );
    }
}
// ************************************************************************* //
